trade_exp/src/InformationRegisters/Неликвиды/Неликвиды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6135d411-f6c1-4357-98b2-8efecc3556b2">
  <name>Неликвиды</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="1d5252ff-fc63-4e13-9707-bb7deec18032">
    <name>Ликвидность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="8808cf9a-cb1b-4ca8-a2ac-e01687e6c2f9">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="a0e4f1bf-e5ec-49fc-a362-54516c94aadb">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="abb41226-3835-47ce-8649-d3ec24658d9d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2789d090-8df4-4ecb-9284-5e015e1aacd3">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/Неликвиды/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ВернутьЛиквидностьТовара(Номенклатура,Подразделение) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НеликвидыСрезПоследних.Ликвидность КАК Ликвидность
	|ИЗ
	|	РегистрСведений.Неликвиды.СрезПоследних(, ) КАК НеликвидыСрезПоследних
	|ГДЕ
	|	НеликвидыСрезПоследних.Номенклатура = &Номенклатура
	|	И НеликвидыСрезПоследних.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	если ВыборкаДетальныеЗаписи.Следующий() тогда
		возврат ВыборкаДетальныеЗаписи.Ликвидность; 
	иначе
		возврат Перечисления.Ликвидность.ПустаяСсылка()
	Конецесли;
	
КонецФункции // ВернутьКлассТовара()
#КонецЕсли
